Tekla.Structures.ModelInternal.dotReferenceModelObjectAttribute_t
Struct for the ReferenceModelObject

Tekla.Structures.ModelInternal.dotReferenceModelObjectAttribute_t.ReferenceModelId
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotReferenceModelObjectAttribute_t.ReferenceModelObjectIdentifier
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotReferenceModelObjectAttribute_t.AttributeIndex
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotReferenceModelObjectAttribute_t.IFC2X3_Product
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotReferenceModelObjectAttribute_t.IFC2X3_ParametricObject_ShapeProfile
DO NOT USE! For internal usage only!